/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Operasi tidak dapat diselesaikan";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Terjadi kesalahan tidak dikenal (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Tidak Selesai";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Coba lagi nanti.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Tidak Dapat Merekam";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Coba rekam lagi.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Tidak Dapat Merekam";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Hentikan tindakan lainnya dengan %@ dan coba lagi."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Tidak Dapat Merekam";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Coba rekam lagi.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Coba rekam lagi.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operasi Berhenti";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Ruang yang tersedia tidak cukup untuk melanjutkan penulisan file. Sediakan ruang dengan menghapus video atau foto yang ada.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Coba rekam lagi.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Coba rekam lagi.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Panjang maksimum untuk perekaman ini telah tercapai."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Ukuran maksimum untuk perekaman ini telah tercapai."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Hentikan tindakan lainnya dengan alat perekaman dan coba lagi.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Panjang maksimum untuk perekaman ini telah tercapai."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Tidak Dapat Merekam";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Coba rekam lagi.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Tidak Dapat Menggunakan %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Hentikan tindakan lainnya dengan %@ dan coba lagi."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Tidak Dapat Menggunakan %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Hentikan tindakan lainnya dengan %@ dan coba lagi."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Perekaman Terhenti";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Hentikan tindakan lainnya dengan alat perekaman dan coba lagi.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Tidak Selesai";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Coba lagi nanti.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Tidak Dapat Menyelesaikan Ekspor";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Coba ekspor lagi.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Tidak Dapat Mendekode";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Data media tidak dapat didekode. Media ini mungkin rusak.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Format media ini tidak didukung.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Tidak Dapat Menyimpan";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Coba simpan lagi.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Media ini tidak dapat digunakan.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Media ini tidak dapat digunakan.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Media ini tidak dapat digunakan.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Media ini tidak dapat digunakan.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Format media ini tidak didukung.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Media ini mungkin rusak.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Tidak Dapat Mengambil Foto";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Coba ambil foto lagi.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operasi Berhenti";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Operasi tidak didukung untuk konten yang dilindungi."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Konten ini tidak disahkan."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Aplikasi ini tidak diizinkan untuk memutar file ini."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Media ini tidak dapat digunakan.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Tidak Dapat Mendekode";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Enkoder yang diperlukan untuk media ini tidak dapat ditemukan.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Tidak Dapat Mendekode";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Enkoder yang diperlukan untuk media ini tidak dapat ditemukan.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Tidak Dapat Mendekode";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Dekoder yang diperlukan untuk media ini sibuk.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Hentikan tindakan lainnya yang mendekode media dan coba lagi.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Tidak Dapat Mendekode";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Enkoder yang diperlukan untuk media ini sibuk.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Hentikan tindakan lainnya yang mengekode media dan coba lagi.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Tidak Dapat Menggunakan %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@ mungkin tidak digunakan oleh aplikasi yang berjalan di latar belakang."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operasi Berhenti";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Operasi tidak didukung untuk media ini.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operasi Berhenti";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Video tidak dapat dibuat berdasarkan instruksi yang diberikan.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Tidak Dapat Membuka";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Media ini tidak dapat digunakan.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operasi Berhenti";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "File cache di URL tujuan download tidak dapat digunakan.";
